In [1]:
import sqlite3

In [2]:
connection = sqlite3.connect('OurDataBase.db')

In [5]:
cursor = connection.cursor()

In [6]:
#SQL datatype

#integer
#real
#text
#blobs(binery large object)
#null

In [7]:
cursor.execute('CREATE TABLE employees(name TEXT,sarname TEXT,salary REAL)')

In [8]:
connection.commit()

In [18]:
cursor.execute("INSERT INTO employees VALUES('mitali','navadiya','1000000')")

In [19]:
connection.commit()

In [27]:
cursor.execute("SELECT * FROM employees")

In [25]:
cursor.fetchone()

('uttam', 'pipaliya', 1000000.0)

cursor.fetchone()

In [26]:
cursor.fetchall()

[('mitali', 'navadiya', 1000000.0)]

In [28]:
for i in cursor.execute("SELECT * FROM employees"):
    print(i)

('uttam', 'pipaliya', 1000000.0)
('mitali', 'navadiya', 1000000.0)

In [29]:
name = "apush"
surname = 'pipaliya'
salary = 5000000

In [ ]:
name = input("enter your name:")
surname = input("Enter your Surname:")
salary = float(input("Enter your salary:"))

In [30]:
cursor.execute("INSERT INTO employees VALUES(?,?,?)",(name,surname,salary))

In [31]:
cursor.execute("SELECT * FROM employees")

In [32]:
cursor.fetchall()

[('uttam', 'pipaliya', 1000000.0),
 ('mitali', 'navadiya', 1000000.0),
 ('apush', 'pipaliya', 5000000.0)]

In [35]:
class SQLinput:
    
    def __init__(self,name,surname,salary):
        self.name = name
        self.surname = surname
        self.salary = salary

In [36]:
inst = SQLinput('dhruval','savaliya',4000000)

In [37]:
name,surname,salary = inst.name,inst.surname,inst.salary

In [38]:
cursor.execute("INSERT INTO employees VALUES(?,?,?)",(name,surname,salary))

In [40]:
cursor.execute("SELECT * FROM employees")

In [42]:
cursor.fetchall()

[('uttam', 'pipaliya', 1000000.0),
 ('mitali', 'navadiya', 1000000.0),
 ('apush', 'pipaliya', 5000000.0),
 ('dhruval', 'savaliya', 4000000.0)]